In [1]:
import pandas as pd

In [20]:
data = [[9,6,3], [8,5,2], [7,4,1]]

In [21]:
data

[[9, 6, 3], [8, 5, 2], [7, 4, 1]]

In [22]:
list ('abc')

['a', 'b', 'c']

In [27]:
df = pd.DataFrame(data, list('zyx'), list('cba'))

In [28]:
df

   c  b  a
z  9  6  3
y  8  5  2
x  7  4  1

In [37]:
df.sort_index()
df.sort_index(inplace = True, axis = 1)
df

   a  b  c
z  3  6  9
y  2  5  8
x  1  4  7

In [38]:
df

   a  b  c
z  3  6  9
y  2  5  8
x  1  4  7

In [34]:
df.sort_index(inplace = True, axis = 1)

In [12]:
df

   x  y  z
1  9  8  7
2  6  5  4
3  3  2  1

In [14]:
df.sort_values(by = 'x', inplace = True)

In [15]:
df

   x  y  z
3  3  2  1
2  6  5  4
1  9  8  7

In [18]:
df.sort_values(by = '3', axis=1, inplace = True)

In [19]:
df

   z  y  x
3  1  2  3
2  4  5  6
1  7  8  9

In [85]:
data = [['Ary', 'M', '21'],
        ['catia', 'F', '19'],
        ['carlos', 'M', '50'],
        ['beto', 'M', '29'],
        ['bruna', 'F', '31'],
        ['ana', 'F', '42']]

In [88]:
data

[['Ary', 'M', '21'],
 ['catia', 'F', '19'],
 ['carlos', 'M', '50'],
 ['beto', 'M', '29'],
 ['bruna', 'F', '31'],
 ['ana', 'F', '42']]

In [89]:
df_a = pd.DataFrame(data)

In [90]:
df_a

        0  1   2
0     Ary  M  21
1   catia  F  19
2  carlos  M  50
3    beto  M  29
4   bruna  F  31
5     ana  F  42

In [91]:
df_a = pd.DataFrame(data, columns = ['nome', 'sexo', 'idade'])

In [92]:
df_a

     nome sexo idade
0     Ary    M    21
1   catia    F    19
2  carlos    M    50
3    beto    M    29
4   bruna    F    31
5     ana    F    42

In [109]:
df_b = df_a.sort_values(by= ['sexo','nome'])

In [110]:
df_b

     nome sexo idade
5     ana    F    42
4   bruna    F    31
1   catia    F    19
0     Ary    M    21
3    beto    M    29
2  carlos    M    50